pgfds-metrics/old_logs/benchmark_logs/20250320_173119/benchmark_100_rps.log
Running 5m test @ http://localhost:5000
  4 threads and 100 connections
  Thread calibration: mean lat.: 28.001ms, rate sampling interval: 169ms
  Thread calibration: mean lat.: 29.899ms, rate sampling interval: 184ms
  Thread calibration: mean lat.: 30.980ms, rate sampling interval: 188ms
  Thread calibration: mean lat.: 32.072ms, rate sampling interval: 202ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.17ms   38.90ms 215.94ms   82.12%
    Req/Sec    24.83     41.95   148.00     81.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.66ms
 75.000%   49.38ms
 90.000%   91.33ms
 99.000%  151.68ms
 99.900%  182.91ms
 99.990%  199.17ms
 99.999%  216.06ms
100.000%  216.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.568     0.000000            1         1.00
       2.337     0.100000         2892         1.11
       3.285     0.200000         5788         1.25
       4.239     0.300000         8680         1.43
       5.575     0.400000        11566         1.67
       7.663     0.500000        14457         2.00
       9.327     0.550000        15903         2.22
      11.983     0.600000        17349         2.50
      16.767     0.650000        18796         2.86
      31.071     0.700000        20237         3.33
      49.375     0.750000        21686         4.00
      55.999     0.775000        22408         4.44
      62.463     0.800000        23130         5.00
      68.927     0.825000        23851         5.71
      75.647     0.850000        24574         6.67
      82.751     0.875000        25302         8.00
      87.039     0.887500        25659         8.89
      91.327     0.900000        26024        10.00
      96.127     0.912500        26381        11.43
     101.887     0.925000        26747        13.33
     108.031     0.937500        27106        16.00
     111.615     0.943750        27287        17.78
     114.815     0.950000        27467        20.00
     118.655     0.956250        27648        22.86
     123.007     0.962500        27831        26.67
     127.743     0.968750        28009        32.00
     130.175     0.971875        28100        35.56
     133.503     0.975000        28190        40.00
     136.575     0.978125        28279        45.71
     139.647     0.981250        28372        53.33
     142.591     0.984375        28459        64.00
     145.663     0.985938        28504        71.11
     147.839     0.987500        28549        80.00
     150.655     0.989062        28598        91.43
     152.959     0.990625        28640       106.67
     156.415     0.992188        28685       128.00
     158.207     0.992969        28707       142.22
     160.255     0.993750        28730       160.00
     162.175     0.994531        28752       182.86
     164.095     0.995313        28777       213.33
     167.551     0.996094        28798       256.00
     168.575     0.996484        28809       284.44
     169.471     0.996875        28821       320.00
     170.495     0.997266        28832       365.71
     172.031     0.997656        28843       426.67
     174.335     0.998047        28854       512.00
     175.103     0.998242        28860       568.89
     176.767     0.998437        28865       640.00
     179.839     0.998633        28871       731.43
     181.119     0.998828        28877       853.33
     182.911     0.999023        28882      1024.00
     184.447     0.999121        28885      1137.78
     185.727     0.999219        28888      1280.00
     187.903     0.999316        28891      1462.86
     189.055     0.999414        28894      1706.67
     190.079     0.999512        28896      2048.00
     190.719     0.999561        28898      2275.56
     191.743     0.999609        28899      2560.00
     193.023     0.999658        28901      2925.71
     193.279     0.999707        28902      3413.33
     194.303     0.999756        28903      4096.00
     196.223     0.999780        28904      4551.11
     197.119     0.999805        28905      5120.00
     198.015     0.999829        28906      5851.43
     198.015     0.999854        28906      6826.67
     199.167     0.999878        28907      8192.00
     199.167     0.999890        28907      9102.22
     200.191     0.999902        28908     10240.00
     200.191     0.999915        28908     11702.86
     200.191     0.999927        28908     13653.33
     202.751     0.999939        28909     16384.00
     202.751     0.999945        28909     18204.44
     202.751     0.999951        28909     20480.00
     202.751     0.999957        28909     23405.71
     202.751     0.999963        28909     27306.67
     216.063     0.999969        28910     32768.00
     216.063     1.000000        28910          inf
#[Mean    =       29.167, StdDeviation   =       38.902]
#[Max     =      215.936, Total count    =        28910]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 5.00m, 27.56MB read
Requests/sec:    100.01
Transfer/sec:     94.07KB